//ALLOCDAT JOB 1,NOTIFY=&SYSUID
//* ALLOCATE THE CORE BANKING ACCOUNTS DATASET
//STEP01   EXEC PGM=IEFBR14
//ACCOUNTS DD DSN=Z83965.BANK.ACCOUNTS,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(DSORG=PS,RECFM=FB,LRECL=68,BLKSIZE=0)