//ALLOCPDS JOB 1,NOTIFY=&SYSUID
//* ALLOCATE COBOL SOURCE LIBRARY (PDS)
//STEP01   EXEC PGM=IEFBR14
//SOURCE   DD DSN=Z83965.BANK.SOURCE,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5,10)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=0)